app/views/messages/index.html.erb

		<div class="col-xs-2">
			<%= image_tag(User.find_by_id(message.sender_id).image, class: "protrait")%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]