app/views/connections/index.html.erb

SELECT "connections".* FROM "connections" WHERE "connections"."user_id" = ?  [["user_id", 3]]
---
<div class="col-xs-8">
	<% @user.connections.each do |connection| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
				<div class="col-xs-1">
					<%= image_tag(User.find_by(id: connection.user_two_id).image, class: "protrait") %>