app/views/tweets/show.html.erb

  			<div class="col-xs-2">
  				<%= image_tag(User.find_by(id: @tweet.user_id).image, class: "protrait")%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]

  			<% end %>
  			<% comments = Comment.where(tweet_id: @tweet.id).order('date desc') %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."tweet_id" = ?  ORDER BY date desc  [["tweet_id", 5]]