app/views/users/index.html.erb

SELECT  "follows".* FROM "follows" WHERE "follows"."star_id" = ? AND "follows"."fan_id" = ? LIMIT 1  [["star_id", 2], ["fan_id", 3]]
---

			<% if Follow.find_by_fan_id_and_star_id(user.id, session["user_id"]).present? && Follow.find_by_star_id_and_fan_id(user.id, session["user_id"]).present?  %>

SELECT  "connections".* FROM "connections" WHERE "connections"."user_one_id" = ? AND "connections"."user_two_id" = ? LIMIT 1  [["user_one_id", 1], ["user_two_id", 3]]
SELECT "users".* FROM "users" WHERE (username LIKE '%hao')
INSERT INTO "connections" ("user_one_id", "user_two_id", "date") VALUES (?, ?, ?)  [["user_one_id", 1], ["user_two_id", 5], ["date", 1433101551]]
---

			<% connection =  Connection.find_by_user_one_id_and_user_two_id(user.id,session["user_id"]) || Connection.find_by_user_one_id_and_user_two_id(session["user_id"], user.id) %>
			<% if ! connection.present? %>
			<% connection = Connection.create(user_one_id: user.id, user_two_id: session["user_id"], date: DateTime.now.to_i) %>