app/controllers/comments_controller.rb

	def create
		@comment = Comment.new
		@comment.content = params[:comment]
		@comment.tweet_id = params[:tweet_id]
		@comment.date = DateTime.now.to_i
		@comment.user_id = session["user_id"]
		if @comment.save
---
INSERT INTO "comments" ("content", "tweet_id", "date", "user_id") VALUES (?, ?, ?, ?)  [["content", "first comment"], ["tweet_id", 5], ["date", 1432015345], ["user_id", 3]]

	def destroy
		if Comment.find_by(id: params[:id]).delete
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]