app/controllers/connections_controller.rb

	def index
		@user = User.find_by_id(session["user_id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]