app/controllers/follows_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
	def find_user
		@user = User.find_by_id(params["user_id"])

INSERT INTO "follows" ("star_id", "fan_id") VALUES (?, ?)  [["star_id", 1], ["fan_id", 3]]
---
	def create
		follow = Follow.new
		follow.star_id = params["user_id"]
		follow.fan_id = session["user_id"]
		if follow.save

DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 6]]
SELECT  "follows".* FROM "follows" WHERE "follows"."id" = ? LIMIT 1  [["id", 6]]
---
	def destroy
		Follow.find_by_id(params["id"]).delete