app/controllers/messages_controller.rb

SELECT  "connections".* FROM "connections" WHERE "connections"."id" = ? LIMIT 1  [["id", 1]]
---
	def find_connection
		@connection = Connection.find_by_id(params["connection_id"])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "messages".* FROM "messages" WHERE "messages"."connection_id" = ?  ORDER BY date desc LIMIT 100  [["connection_id", 1]]
---
	def index
		@user = User.find_by_id(session["user_id"])
		@messages = @connection.messages.limit(100).order("date")

INSERT INTO "messages" ("content", "connection_id", "sender_id", "receiver_id", "date") VALUES (?, ?, ?, ?, ?)  [["content", "new message"], ["connection_id", 1], ["sender_id", 3], ["receiver_id", 2], ["date", 1433022364]]
---
	def create
		message = Message.new
		message.content = params["message"]
		message.connection_id = params["connection_id"]
		message.sender_id = session["user_id"]
		message.receiver_id = @connector_id
		message.date = DateTime.now.to_i
		if message.save