app/controllers/users_controller.rb

	def index
    if params["keyword"].present?
      @users = User.where("username LIKE ?", "%#{params[:keyword]}%")
    else
      @users = User.all
---
SELECT "users".* FROM "users" WHERE (username LIKE '%hao')
SELECT "users".* FROM "users"

	def create
		@user = User.new(username: params[:username], email: params[:email], password: params[:password])
		@user.image = "http://tp1.sinaimg.cn/1631772764/50/40008304461/0";
		if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest") VALUES (?, ?, ?)  [["username", "fewafewaf"], ["email", "lingduokong@gmail"], ["password_digest", "$2a$10$QV/zMFmau6O.BouGh447DO0g5plgEDeBAP66qnWak5F5wF3YNCvfy"]]

	def update
		@user = User.find_by(id: params[:id])
		@user.username = params[:username]
		@user.email = params[:email]
		@user.image = params[:image]

		if params[:password] == params[:repassword]
			@user.password = params[:password]
			if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "password_digest" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$kirixU.3819YfRgBG1B7O.jkqXproxA4fs1jza5VmyRFGp.3r0..y"], ["id", 3]]