app/controllers/websites_controller.rb

	def index
		@websites = Website.all
---
SELECT "websites".* FROM "websites"

	def create
    Website.create server: params[:server],
             rank: params[:rank]
---
INSERT INTO "websites" ("server", "rank") VALUES (?, ?)  [["server", "www.google.com"], ["rank", 1]]

	def destroy
		Website.delete(params[:id])
---
DELETE FROM "websites" WHERE "websites"."id" = ?  [["id", 0]]

	def show
		@website = Website.find(params[:id])
---
SELECT  "websites".* FROM "websites" WHERE "websites"."id" = ? LIMIT 1  [["id", 1]]

	def update
		@website = Website.find(params[:id])
    @website.update server: params[:server],
                 rank: params[:rank]
---
SELECT  "websites".* FROM "websites" WHERE "websites"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "websites" SET "rank" = ? WHERE "websites"."id" = ?  [["rank", 3], ["id", 1]]

	def edit
		@website = Website.find(params[:id])
---
SELECT  "websites".* FROM "websites" WHERE "websites"."id" = ? LIMIT 1  [["id", 1]]